quem_pegou_app/app/controllers/livros_controller.rb

SELECT "livros".* FROM "livros"
---
  def index
    @livros = Livro.all

INSERT INTO "livros" ("autor", "created_at", "dataEmprestimo", "dataEntrega", "dataPublicacao", "nome", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @livro = Livro.new(livro_params)

    respond_to do |format|
      if @livro.save

SELECT  "livros".* FROM "livros"  WHERE "livros"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_livro
      @livro = Livro.find(params[:id])