quem_pegou_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("cpf", "created_at", "curso", "endereco", "nome", "updated_at") VALUES (?, ?, ?, ?, ?, ?)